src/InformationRegisters/ИсторияОбменаССайтомВозвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаССайтомВозвраты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаССайтомВозвраты/Ext/ManagerModule.bsl
Процедура Добавить(ИмяФайла, АктРассмотренияВозврата = Неопределено, ТекстФайла = "", Ошибка = Ложь, ТекстОшибки = "", Исходящее = Ложь) Экспорт
	
	
	  МЗ 							= РегистрыСведений.ИсторияОбменаССайтомВозвраты.СоздатьМенеджерЗаписи();
	  МЗ.Период 					= ТекущаяДата();
	  МЗ.ИмяФайла 					= ИмяФайла;
	  МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	  МЗ.ТекстФайла 				= ТекстФайла;
	  МЗ.Ошибка 					= Ошибка;
	  МЗ.ТекстОшибки 				= ТекстОшибки;
	  МЗ.Исходящее 					= Исходящее;
	  МЗ.Записать();
	
КонецПроцедуры
